[
  { "id": 1, "productId": 1, "author": "Emily R.", "date": "Sep 12, 2025", "rating": 5, "comment": "Absolutely stunning sofa! The organic linen is so soft and the color is perfect. It feels incredibly well-made and was the perfect centerpiece for our living room. Highly recommend!" },
  { "id": 2, "productId": 1, "author": "Mark T.", "date": "Sep 1, 2025", "rating": 4, "comment": "Great product and I love the sustainable mission. The frame feels very solid. My only minor issue was that it was a bit firmer than I expected, but it's been softening up over time." },
  { "id": 3, "productId": 1, "author": "Laura P.", "date": "Aug 25, 2025", "rating": 5, "comment": "The delivery was seamless and the sofa is even more beautiful in person. The quality is top-notch. Worth every penny for a piece that's both stylish and eco-friendly." },
  { "id": 4, "productId": 1, "author": "James K.", "date": "Aug 15, 2025", "rating": 5, "comment": "Comfortable, stylish, and I feel good knowing it's made from sustainable materials. It's the best piece of furniture I've ever bought online." },
  { "id": 5, "productId": 1, "author": "Chloe B.", "date": "Aug 5, 2025", "rating": 4, "comment": "Love the minimalist design. It fits perfectly in our small apartment. The linen fabric does wrinkle a bit, but that's to be expected and adds to the relaxed look." },
  { "id": 6, "productId": 2, "author": "Jessica Chen", "date": "Sep 1, 2025", "rating": 5, "comment": "This chair is a work of art. The reclaimed oak has so much character and it's surprisingly comfortable. It's my new favorite reading spot." },
  { "id": 7, "productId": 2, "author": "Ben Carter", "date": "Aug 28, 2025", "rating": 5, "comment": "Solid construction and a beautiful design. It's a statement piece for sure. The organic cotton cushions are very high quality." },
  { "id": 8, "productId": 2, "author": "Olivia G.", "date": "Aug 20, 2025", "rating": 4, "comment": "A wonderful accent chair. It's a bit smaller than I imagined from the photos, but it ended up fitting the space perfectly. The wood grain is gorgeous." },
  { "id": 9, "productId": 2, "author": "Daniel S.", "date": "Aug 11, 2025", "rating": 5, "comment": "Exceeded my expectations. You can feel the craftsmanship. It's sturdy, elegant, and a great conversation starter." },
  { "id": 10, "productId": 2, "author": "Ava W.", "date": "Aug 2, 2025", "rating": 5, "comment": "I bought two of these for my entryway and they look fantastic. Sleek, modern, and eco-conscious. What's not to love?" },
  { "id": 11, "productId": 2, "author": "Noah F.", "date": "Jul 25, 2025", "rating": 4, "comment": "Really happy with this purchase. The assembly was straightforward. The cushions are firm and supportive." },
  { "id": 12, "productId": 3, "author": "David L.", "date": "Sep 5, 2025", "rating": 5, "comment": "The perfect dining table. The bamboo is beautiful and so easy to clean. We've already hosted several dinner parties and received so many compliments." },
  { "id": 13, "productId": 3, "author": "Sophia M.", "date": "Aug 22, 2025", "rating": 5, "comment": "I'm in love with this table. The minimalist design is exactly what I was looking for. It's incredibly sturdy and the matte finish is lovely." },
  { "id": 14, "productId": 3, "author": "Liam Johnson", "date": "Aug 18, 2025", "rating": 4, "comment": "A great, sustainable choice for a dining table. It's very spacious. It did have a very minor scratch on one leg upon arrival, but customer service was excellent and resolved it quickly." },
  { "id": 15, "productId": 3, "author": "Emma B.", "date": "Aug 10, 2025", "rating": 5, "comment": "This table transformed our dining room. It's light, airy, and makes the whole space feel bigger. Assembly was a breeze." },
  { "id": 16, "productId": 3, "author": "Lucas R.", "date": "Aug 1, 2025", "rating": 5, "comment": "Fantastic quality. The bamboo has a wonderful, warm tone. It feels like it will last for many years to come." },
  { "id": 17, "productId": 3, "author": "Isabella H.", "date": "Jul 20, 2025", "rating": 4, "comment": "We love our new table! It's the perfect size for our family. I do wish it was slightly more resistant to water marks, but coasters solve that easily." },
  { "id": 18, "productId": 3, "author": "Mason P.", "date": "Jul 12, 2025", "rating": 5, "comment": "Simple, elegant, and eco-friendly. It's everything I wanted in a dining table. 10/10 would recommend." },
  { "id": 19, "productId": 4, "author": "Sophie A.", "date": "Aug 22, 2025", "rating": 4, "comment": "Very stylish and comfortable lounge chair. The hemp weave is unique and feels very durable. A great addition to our sunroom." },
  { "id": 20, "productId": 4, "author": "Ethan K.", "date": "Aug 14, 2025", "rating": 5, "comment": "This is my new favorite chair. It's incredibly comfortable for lounging and reading. The reclaimed teak is beautiful and has a great story." },
  { "id": 21, "productId": 4, "author": "Mia Garcia", "date": "Aug 5, 2025", "rating": 5, "comment": "Stunning design and surprisingly comfortable. The hemp seating has a nice give to it. It feels very high-end." },
  { "id": 22, "productId": 4, "author": "Alexander V.", "date": "Jul 29, 2025", "rating": 3, "comment": "The chair looks great, but the seating is a bit rougher than I expected from hemp. It's not uncomfortable, but I'd recommend a cushion for longer periods of sitting." },
  { "id": 23, "productId": 4, "author": "Harper L.", "date": "Jul 21, 2025", "rating": 5, "comment": "Perfect for our covered patio. It has a wonderful, natural vibe and is very well-built. It feels like a piece of functional art." },
  { "id": 24, "productId": 4, "author": "Evelyn C.", "date": "Jul 15, 2025", "rating": 4, "comment": "Love the look and the sustainable materials. It's a bit low to the ground, which is perfect for a lounge chair, but something to be aware of." },
  { "id": 25, "productId": 4, "author": "Logan M.", "date": "Jul 8, 2025", "rating": 5, "comment": "An amazing chair. It's the perfect blend of rustic and modern. I'm considering buying a second one." },
  { "id": 26, "productId": 1, "author": "Grace N.", "date": "Jul 1, 2025", "rating": 5, "comment": "I was nervous about buying a sofa online, but this exceeded all my expectations. It's the perfect combination of firm and comfortable." },
  { "id": 27, "productId": 2, "author": "Henry J.", "date": "Jun 28, 2025", "rating": 5, "comment": "The craftsmanship is evident. A beautiful, solid piece of furniture that I know will last." },
  { "id": 28, "productId": 3, "author": "Lily Q.", "date": "Jun 20, 2025", "rating": 5, "comment": "So happy with this purchase. The bamboo is gorgeous and it was so easy to put together. It really brightens up our dining area." },
  { "id": 29, "productId": 4, "author": "Jack R.", "date": "Jun 10, 2025", "rating": 4, "comment": "A very cool and unique chair. The hemp is a bit stiff at first but it's breaking in nicely. Looks great in my office." },
  { "id": 30, "productId": 1, "author": "Aria Z.", "date": "Jun 5, 2025", "rating": 5, "comment": "This sofa is a dream. It's beautiful, comfortable, and I love that it's made with eco-friendly materials. It's the heart of our home now." }
]